# 데이터 그룹분석 & 피봇팅 연습문제

필요한 모듈 임포트

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

### 연습문제 1. 붓꽃(iris) 데이터

- seaborn 라이브러리에 있는 'iris' 데이터 로드

In [3]:
# 붓꽃(iris) 데이터 로드
df = sns.load_dataset('iris')

#### iris 데이터를 이용하여 다음의 문제를 해결하시오.

#### 1) 데이터 살펴보기

- 데이터 앞부분 보기

In [4]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

- 데이터 정보 확인(변수, 데이터유형 등)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

#### 2) 붓꽃 품종(species)별로 데이터 그룹화

In [6]:
# 붓꽃 종 별로 그룹핑
df1 = df.groupby('species')
df1

#### 3) 품종별 꽃잎길이(petal_length)의 평균을 구하시오.

In [7]:
df1['petal_length'].mean()

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64

#### 3) 품종별 꽃받침길이(sepal_length)의 평균을 구하시오.

In [8]:
df1['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

----

### 연습문제 2. Tips 데이터

tips 데이터를 이용하여 다음의 문제를 해결하시오.

In [9]:
# seaborn 라이브러리의  tips 데이터 로드
df2 = sns.load_dataset('tips')

#### 1) 데이터 살펴보기
- 데이터의 뒷부분 보기

In [41]:
df2.tail()

     total_bill    tip     sex smoker   day    time  size  tip_pt
239     29.0300 5.9200    Male     No   Sat  Dinner     3  0.2039
240     27.1800 2.0000  Female    Yes   Sat  Dinner     2  0.0736
241     22.6700 2.0000    Male    Yes   Sat  Dinner     2  0.0882
242     17.8200 1.7500    Male     No   Sat  Dinner     2  0.0982
243     18.7800 3.0000  Female     No  Thur  Dinner     2  0.1597

변수 설명
- total_bill : 지불금액
- tips : 팁금액
- sex : 고객의 성별
- smoker : 흡연구역여부 (Yes: 흡연구역, No: 금연구역)
- time : 시간대
- size : 테이블당 인원수

데이터 정보 확인(변수, 데이터유형 등)

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

#### 2)  'total_bill' 대비 팁 요금(tip)의 비율을 계산하고 'tip_pt' 열로 저장하시오.

In [12]:
df2['tip_pt'] = df2['tip'] / df2['total_bill']

In [42]:
df2.tail(3)

     total_bill    tip     sex smoker   day    time  size  tip_pt
241     22.6700 2.0000    Male    Yes   Sat  Dinner     2  0.0882
242     17.8200 1.7500    Male     No   Sat  Dinner     2  0.0982
243     18.7800 3.0000  Female     No  Thur  Dinner     2  0.1597

In [14]:
df2.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'tip_pt'], dtype='object')

#### 3) 요일별 손님의 수는?

In [53]:
df3 = df2.groupby('day', observed=False)
df3

In [16]:
df3.count()

      total_bill  tip  sex  smoker  time  size  tip_pt
day
Thur          62   62   62      62    62    62      62
Fri           19   19   19      19    19    19      19
Sat           87   87   87      87    87    87      87
Sun           76   76   76      76    76    76      76

- 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

- 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

#### 4) 요일별 테이블당 평균인원수는?

In [17]:
df3['size'].mean()

day
Thur    2.451613
Fri     2.105263
Sat     2.517241
Sun     2.842105
Name: size, dtype: float64

#### 5) 시간대(점심/저녁) 별 손님 수 비교

In [18]:
df2['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

#### 6) 시간대(점심/저녁) 별 테이블당 평균인원수

In [52]:
dftime = df2.groupby('time', observed=False)
dftime['size'].mean()

time
Lunch    2.4118
Dinner   2.6307
Name: size, dtype: float64

#### 7) 각 요일에 따른 시간대별(점심/저녁) 손님 수를 피봇테이블로 작성

In [20]:
df2.pivot_table('size',index='day',columns='time',aggfunc='count')

time  Lunch  Dinner
day
Thur     61       1
Fri       7      12
Sat       0      87
Sun       0      76

#### 8) 요일별 테이블당 평균 인원수와  최대인원수, 최소인원수를 피봇테이블로 작성

In [43]:
df2.pivot_table('size',index='day',aggfunc=['mean','max','min'])

       mean  max  min
       size size size
day
Thur 2.4516    6    1
Fri  2.1053    4    1
Sat  2.5172    5    1
Sun  2.8421    6    2

#### 9) 요일별 시간대에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [44]:
df2.pivot_table('size',index=['day','time'],aggfunc=['mean','max','min'])

              mean    max    min
              size   size   size
day  time
Thur Lunch  2.4590 6.0000 1.0000
     Dinner 2.0000 2.0000 2.0000
Fri  Lunch  2.0000 3.0000 1.0000
     Dinner 2.1667 4.0000 2.0000
Sat  Dinner 2.5172 5.0000 1.0000
Sun  Dinner 2.8421 6.0000 2.0000

#### 10) 각 시간대별로 요일에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [46]:
pd.options.display.float_format = '{:.2f}'.format

In [47]:
df2.pivot_table('size', index='time', columns='day',aggfunc=['mean','max','min']).fillna(0)

       mean                 max                 min
day    Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun
time
Lunch  2.46 2.00 0.00 0.00 6.00 3.00 0.00 0.00 1.00 1.00 0.00 0.00
Dinner 2.00 2.17 2.52 2.84 2.00 4.00 5.00 6.00 2.00 2.00 1.00 2.00

#### 11) 요일별 tip_pt의 평균 계산

In [25]:
df3[['tip_pt']].mean()

      tip_pt
day
Thur    0.16
Fri     0.17
Sat     0.15
Sun     0.17

#### 12) 시간대별 tip_pt의 평균 계산

In [26]:
dftime[['tip_pt']].mean()

        tip_pt
time
Lunch     0.16
Dinner    0.16

#### 11) 각 요일마다 시간대(점심/저녁) 별 tip_pt의 평균

In [48]:
pd.options.display.float_format = '{:.4f}'.format

In [49]:
df2.pivot_table('tip_pt',index=['day','time'], aggfunc='mean')

             tip_pt
day  time
Thur Lunch   0.1613
     Dinner  0.1597
Fri  Lunch   0.1888
     Dinner  0.1589
Sat  Dinner  0.1532
Sun  Dinner  0.1669

#### 12) 요일마다 시간대(점심/저녁) 별 평균인원수와 팁비율의 평균 계산

In [51]:
df2.pivot_table(['size','tip_pt'],index=['day','time'], aggfunc='mean')

              size  tip_pt
day  time
Thur Lunch  2.4590  0.1613
     Dinner 2.0000  0.1597
Fri  Lunch  2.0000  0.1888
     Dinner 2.1667  0.1589
Sat  Dinner 2.5172  0.1532
Sun  Dinner 2.8421  0.1669

----

### 연습문제 3. titanic 데이터

타이타닉 승객 데이터를 이용하여 다음 분석을 수행하시오.

#### 1) 데이터 로드

In [30]:
# seaborn 라이브러리의 titanic 데이터 로드
dft = sns.load_dataset('titanic')

#### 2) 데이터 살펴보기

In [31]:
dft.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 3) 나이(age)를 qcut을 사용하여 세 개의 그룹으로 만든다.
- label은 ['청년','중년','장년']

In [32]:
dft['age_group'] = pd.qcut(dft['age'],q=3, labels=['청년','중년','장년'])
dft

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22.0000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년
1,1,1,female,38.0000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년
2,1,3,female,26.0000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,중년
3,1,1,female,35.0000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,장년
4,0,3,male,35.0000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,장년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,중년
887,1,1,female,19.0000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,청년
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,중년
890,0,3,male,32.0000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,중년

#### 4) 선실(class), 성별(sex), 나이 그룹에 따른 생존여부 그룹으로 그룹화

In [33]:
dft.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'age_group'],
      dtype='object')

In [57]:
dft2 = dft.groupby(['survived','class','sex','age_group'], observed=True)

In [60]:
dft2.size()

survived  class   sex     age_group
0         First   female  청년            1
                          중년            1
                          장년            1
                  male    청년            5
                          중년           11
                          장년           45
          Second  female  중년            3
                          장년            3
                  male    청년           18
                          중년           36
                          장년           30
          Third   female  청년           29
                          중년           14
                          장년           12
                  male    청년           90
                          중년           74
                          장년           51
1         First   female  청년           21
                          중년           18
                          장년           43
                  male    청년            5
                          중년           11
                          장년           24
          Second  female  청년           20
                          중년           30
                          장년           18
                  male    청년           10
                          중년            3
                          장년            2
          Third   female  청년           30
                          중년           13
                          장년            4
                  male    청년           17
                          중년           18
                          장년            3
dtype: int64

In [35]:
dft.pivot_table(['class','sex','age_group'], index='survived',aggfunc='count')

          age_group  class  sex
survived
0               424    549  549
1               290    342  342

#### 5) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 데이터프레임으로 생성

- 행에는 선실, 성별, 나이그룹에 대한 다중 인덱스를 사용하고 열에는 생존 인덱스를 사용한다.

In [72]:
dft.groupby(['class','sex','age_group','alive'], observed=False)[['survived']].count()

                               survived
class  sex    age_group alive
First  female 청년        no            1
                        yes          21
              중년        no            1
                        yes          18
              장년        no            1
                        yes          43
       male   청년        no            5
                        yes           5
              중년        no           11
                        yes          11
              장년        no           45
                        yes          24
Second female 청년        no            0
                        yes          20
              중년        no            3
                        yes          30
              장년        no            3
                        yes          18
       male   청년        no           18
                        yes          10
              중년        no           36
                        yes           3
              장년        no           30
                        yes           2
Third  female 청년        no           29
                        yes          30
              중년        no           14
                        yes          13
              장년        no           12
                        yes           4
       male   청년        no           90
                        yes          17
              중년        no           74
                        yes          18
              장년        no           51
                        yes           3

#### 6) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 피봇테이블로 생성

In [37]:
dft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  age_group    714 non-null    category
dtypes: bool(2), category(3), float64(2), int64(4), object(5)
memory usage: 81.7+ KB

In [73]:
dft1 = dft.pivot_table('survived',index=['sex','age_group'],columns=['class','alive'],aggfunc='count')
dft1

class            First     Second     Third
alive               no yes     no yes    no yes
sex    age_group
female 청년            1  21      0  20    29  30
       중년            1  18      3  30    14  13
       장년            1  43      3  18    12   4
male   청년            5   5     18  10    90  17
       중년           11  11     36   3    74  18
       장년           45  24     30   2    51   3

#### 7) 6)에서 생성한 데이터프레임을 이용하여 성별과 나이그룹에 따른 First class 인원수를 파악하라

In [74]:
dft1['First'].sum(axis=1)

sex     age_group
female  청년           22
        중년           19
        장년           44
male    청년           10
        중년           22
        장년           69
dtype: int64

#### 8) 6)에서 생성한 데이터프레임을 이용하여 성별, 나이그룹, 선실별에 따른 생존율을 파악하시오.
- 행은 성별, 나이그룹의 다중인덱스로 하고, 열은 선실(class)로 한다.
- 생존률은 해당 그룹의 생존 인원수를 전체 인원수로 나눈 값이다.

In [40]:
dft1

class            First     Second     Third
alive               no yes     no yes    no yes
sex    age_group
female 청년            1  21      0  20    29  30
       중년            1  18      3  30    14  13
       장년            1  43      3  18    12   4
male   청년            5   5     18  10    90  17
       중년           11  11     36   3    74  18
       장년           45  24     30   2    51   3

In [92]:
dft2 = dft1.stack(level='alive')
dft2
dft3 = dft2.groupby(['sex','age_group'], observed=False).sum()
dft3
dft4 = dft2.drop(index='no', level='alive').droplevel(level='alive')
dft4
dft_rate = dft4 / dft3 * 100
dft_rate

class                   First  Second  Third
sex    age_group alive
female 청년        no         1       0     29
                 yes       21      20     30
       중년        no         1       3     14
                 yes       18      30     13
       장년        no         1       3     12
                 yes       43      18      4
male   청년        no         5      18     90
                 yes        5      10     17
       중년        no        11      36     74
                 yes       11       3     18
       장년        no        45      30     51
                 yes       24       2      3

class             First  Second  Third
sex    age_group
female 청년            22      20     59
       중년            19      33     27
       장년            44      21     16
male   청년            10      28    107
       중년            22      39     92
       장년            69      32     54

class             First  Second  Third
sex    age_group
female 청년            21      20     30
       중년            18      30     13
       장년            43      18      4
male   청년             5      10     17
       중년            11       3     18
       장년            24       2      3

class              First   Second   Third
sex    age_group
female 청년        95.4545 100.0000 50.8475
       중년        94.7368  90.9091 48.1481
       장년        97.7273  85.7143 25.0000
male   청년        50.0000  35.7143 15.8879
       중년        50.0000   7.6923 19.5652
       장년        34.7826   6.2500  5.5556

#### 9) 성별 및 선실에 의한 생존율을 피봇 데이터 형태로 만든다.

In [93]:
dft_rate.pivot_table(index='sex')

class    First  Second   Third
sex
female 95.9729 92.2078 41.3319
male   44.9275 16.5522 13.6695